<font size="6" face="verdana" color="green">
    <b>Introdução à Linguagem SQL</b><br>
    <b>DML:</b><i> <b>D</b>ata <b>M</b>anipulation <b>L</b>anguage</i><br>
    <u>Parte 5</u> &mdash; Tratamento de Atributos Nulos</font>
    </font>

<br><br>

**Objetivo:** Explorar comandos básicos da linguagem sub-linguagem de manipulaçào de dados em SQL,\
    usando como exemplo de teste uma <i>toy database</i> que contém dados sobre as mátriculas de 15 alunos:\
    &emsp; &emsp; __a base de Dados `Alunos15`__

__Atividades:__ 
 * Tratamento de Atributos Nulos:
   *  Nulo é um <b>estado</b>,
   *  Comparar com nulo tem resultado <b>desconhecido.</b>
 * A lógica de 3 valores
 * Funções `COALESCE` e `NULLIF`
 * Operadores de comparação com NULO
   

<br><br>

----

<br>

## 1. Conectar com a Base de Dados

Para começar, sempre é necessário, em cada `Notebook`:
  * Carregar os pacotes que serão usados;
  * Estabelecer a coneção com a base.

In [2]:
# Importar os módulos necessários para o Notebook:
import ipywidgets as widgets     #---
from sqlalchemy import create_engine

# Conectar com um servidor SQL na base Alunos 15 --> Postgres.Alunos15
%load_ext sql

# Connection format: %sql dialect+driver://username:password@host:port/database
engine = create_engine('postgresql://postgres:pgadmin@localhost/alunos15')
%sql postgresql://postgres:postgres@localhost/alunos15

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

<br><br>

----

<br>

## 2. Tratamento de Atributos Nulos

Atributos sem valor assumem o <b><font size="3" face="courier" color="blue"> Estado Nulo</font></b>.

Um atributo pode estar nulo por diversas razões/significados:
  * o valor não existe
  * o valor existe mas não é conhecido
  * o valor não é aplicável
  * o valor ainda/já não é aplicável\
    ...

É possível indicar no esquema da relação se um atributo pode ser nulo ou não:
  * <b><font size="3" face="courier" color="blue">$<$attr$>$ [<u>NULL</u> | NOT NULL]</b>

Além disso, o resultado de algumas operações podem levar a atributos ficarem nulos.

Por exemplo, na relação de `Alunos`:
  * a `idade` da `Dina` não é conhecida,
  * a `cidade` da `Dora` não é conhecida,
  * nem a `idade` nem a `cidade` do `Durvala` não são conhecidas.

In [3]:
%%sql 
SELECT * 
    FROM Aluno
    WHERE Nome ~'^D'; -- Listar só os alunos que começam com a letra `D`

 * postgresql://postgres:***@localhost/alunos15
5 rows affected.

[('Denise', Decimal('4584'), Decimal('35'), 'Ibate', 'Matemática'),
 ('Durval', Decimal('1479'), None, None, 'Computação'),
 ('Daniel', Decimal('1489'), Decimal('19'), 'Campinas', 'Computação'),
 ('Dora', Decimal('1469'), Decimal('24'), None, 'Geografia'),
 ('Dina', Decimal('1459'), None, 'Campinas', None)]

  * Um atributo sem valor numa tupla é dito <b>"estar"</b> `nulo`.
  * `Nulo` não é um valor, é um estado: 
    <div class=”square” style="background-color:#EAF0F0;"><b><font size="3" face="times" color="blue">
Um atributo </u>está</u> nulo, <u>não é</u> nulo.
</font></b></div>

  * Atributos de qualquer tipo podem estar nulos.
  * Comparações entre valores não nulos retornam <font size="3" color="cyan">Verdade</font> ou <font size="3" color="cyan">Falso</font>.
  * Se ao menos um dos valores estiver nulo, a resposta será desconhecida,<br>
    o que é indicado em SQL como `desconhecido`: <font size="3" color="red">unknow</font>.
  * A palavra `NULL` é reservada em SQL, e é usada para atribuir ou comparar atributos com o estado nulo.
  * Existem dois predicados de comparação em SQL:
    <div class=”square” style="background-color:#EAF0F0;"><b><font size="3" face="courier" color="blue">IS NULL</font></b></div>
        e 
    <div class=”square” style="background-color:#EAF0F0;"><b><font size="3" face="courier" color="blue">IS NOT NULL</font></b></div>
		Eles permitem testar se algum atributo está `nulo`.
  * Todos os operadores lógicos, aritméticos e todos os operadores de comparação são estendidos para contemplar o estado `bnulo`.

In [4]:
%%sql 
SELECT * 
    FROM Aluno
    WHERE Cidade IS NULL;

 * postgresql://postgres:***@localhost/alunos15
2 rows affected.

[('Durval', Decimal('1479'), None, None, 'Computação'),
 ('Dora', Decimal('1469'), Decimal('24'), None, 'Geografia')]

<br><br>

----

<br>

Operadores de seleção nas cláusulas `WHERE` e `HAVING` retornam apenas as tuplas cuja condição resulta <b>`Verdade`.</b><br>
  &emsp; <font size="5">&#9758;</font> Não basta  que a condição <b>não seja `Falso`</b>.

Por exemplo, a seguinte consulta sempre retorna um conjunto de tuplas vazio:

In [5]:
%%sql
SELECT Nome
    FROM Aluno
    WHERE Cidade=NULL;

 * postgresql://postgres:***@localhost/alunos15
0 rows affected.

[]

$\bigstar$ Porque o resultado da comparação com `Nulo` é sempre `unknown`.$\bigstar$

<br><br>

----

<br>

## 3. A Lógica de Três valores

O SQL-ISO padroniza as "Operações Lógicas" como uma <b>"Lógica de Três valores"</b>.

Em "Lógica Binária" (por exemplo, Álgebra Booleana), a expressão $P\vee(\neg P)$ é uma tautologia.\
  Em lógica de três valores, ela não é.

O seguinte comando retorna todas as tuplas da relação onde o atributo `Idade` não está nulo,\
 &emsp; <font size="5">&#9758;</font> porque a condição na cláusula:  <font color="blue" size="3">Idade=20 OR Idade$\ne$20</font> é sempre verdade:

In [6]:
%%sql
SELECT *
    FROM ALuno
    WHERE Idade=20 OR Idade<>20;

 * postgresql://postgres:***@localhost/alunos15
13 rows affected.

[('Carlos', Decimal('1234'), Decimal('21'), 'Sao Carlos', 'Computação'),
 ('Celso', Decimal('2345'), Decimal('22'), 'Sao Carlos', 'Computação'),
 ('Cicero', Decimal('3456'), Decimal('22'), 'Araraquara', 'Matemática'),
 ('Carlitos', Decimal('4567'), Decimal('21'), 'Ibitinga', 'Computação'),
 ('Catarina', Decimal('5678'), Decimal('23'), 'Sao Carlos', 'Elétrica'),
 ('Cibele', Decimal('6789'), Decimal('21'), 'Araraquara', 'Computação'),
 ('Corina', Decimal('7890'), Decimal('25'), 'Rio Claro', 'Matemática'),
 ('Celina', Decimal('8901'), Decimal('27'), 'Sao Carlos', 'Computação'),
 ('Celia', Decimal('9012'), Decimal('20'), 'Rio Claro', 'Computação'),
 ('Cesar', Decimal('9123'), Decimal('21'), 'Araraquara', 'Elétrica'),
 ('Denise', Decimal('4584'), Decimal('35'), 'Ibate', 'Matemática'),
 ('Daniel', Decimal('1489'), Decimal('19'), 'Campinas', 'Computação'),
 ('Dora', Decimal('1469'), Decimal('24'), None, 'Geografia')]

No entanto, o comando seguinte nunca retorna nada, pois comparar com `NULL` sempre retorna `unknown`P:

In [7]:
%%sql
SELECT *
    FROM Aluno
    WHERE Idade=NULL OR Idade<>NULL;

 * postgresql://postgres:***@localhost/alunos15
0 rows affected.

[]

Os operadores lógicos e os operadores de comparação são todos estendidos para contemplar o estado `Nulo`, correspondente a `Desconhecido` (?).

Os operadores aritméticos também são estendidos para contemplar o estado `nulo`:
  * Seja $\bigoplus \in \{+, -, *, \div \}$ um operador aritmético.
    * Então, `null` $\bigoplus$ `valor`= `null`
  * <font size="3" color="orange">``O que acontece quando <br>
     &emsp; &emsp; uma <b>força irresistível</b> encontra<br>
	 &emsp; &emsp; um  <b>objeto inemovível</b>''?</font>

    * Quanto vale `null` $*$ 0? &emsp; &emsp; &emsp; &emsp;  &emsp; <font size="5">&#128072;</font> `null` 
    * Quanto vale `null` - `null`  0? &emsp;&emsp;  &emsp; <font size="5">&#128072;</font> `null`
    * Quanto vale `null` $\div$ 0? &emsp; &emsp; &emsp; &emsp;  &emsp; <font size="5">&#128072;</font> `null`

In [8]:
%%sql
SELECT Nome, Idade,
       NULL * 0 Vezes,
       Idade - NULL Menos,
       Idade/0 Divide
    FROM Aluno
    WHERE Nome='Durval'

 * postgresql://postgres:***@localhost/alunos15
1 rows affected.

[('Durval', None, None, None, None)]

### 3.2. Funções para tratar nulos

Existem várias funções específicas para tratar nulos, dentre elas:\
  * <b><font size="3" face="courier" color="blue">
     COALESCE(value [, ...]) </font></b>
  *  <b><font size="3" face="courier" color="blue">
   NULLIF(valor1, valor2) </font></b>

#### 3.2.1. A função `COALESCE`

<div class=”square” style="background-color:#EAF0F0;"><b><font size="3" face="courier" color="blue">
COALESCE(value [, ...])</font></b></div>
<br>

  * Retorna o primeiro valor não nulo da lista de argumentos. 
  * Se todos os argumentos forem nulos, então retorna nulo.
  * Os argumentos são avaliados em sequência, e aqueles à direita do primeiro não nulo não são avaliados.

Por exemplo, suponha que existe a relação:
<div class=”square” style="background-color:#EAF0F0;"><b><font size="3" face="courier" color="teal">
FonePessoa={Nome, Resid, Celular, Comerc, Pais, Esposa}}
</font></b></div>
<br>

In [9]:
%%sql
DROP TABLE IF EXISTS FonePessoa;
CREATE TABLE FonePessoa (
    Nome TEXT,
    Resid TEXT,
    Celular TEXT,
    Comerc TEXT,
    Pais TEXT,
    Esposa TEXT
    );

INSERT INTO FonePessoa VALUES ('Carlos');
INSERT INTO FonePessoa VALUES ('Celso',    '(16)3371-2345');
INSERT INTO FonePessoa VALUES ('Cicero',   '(16)3371-3456', '(16)99371-1000', '(16)3371-2000', '(16)3371-3000', '(16)3371-4000');
INSERT INTO FonePessoa VALUES ('Carlitos', null, null,  null, '(16)3371-3000', '(16)3371-4001');
INSERT INTO FonePessoa VALUES ('Catarina', null,  '(16)99371-1002', '(16)3371-2000', '(16)3371-3002');
INSERT INTO FonePessoa VALUES ('Cibele',   '(16)3371-2003', null,  '(16)3371-2003', '(16)3371-3003', '(16)3371-4003');
INSERT INTO FonePessoa VALUES ('Corina',   '(16)3371-7890', null, null, null, '(16)3371-4004');

SELECT * FROM FonePessoa;

 * postgresql://postgres:***@localhost/alunos15
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
7 rows affected.

[('Carlos', None, None, None, None, None),
 ('Celso', '(16)3371-2345', None, None, None, None),
 ('Cicero', '(16)3371-3456', '(16)99371-1000', '(16)3371-2000', '(16)3371-3000', '(16)3371-4000'),
 ('Carlitos', None, None, None, '(16)3371-3000', '(16)3371-4001'),
 ('Catarina', None, '(16)99371-1002', '(16)3371-2000', '(16)3371-3002', None),
 ('Cibele', '(16)3371-2003', None, '(16)3371-2003', '(16)3371-3003', '(16)3371-4003'),
 ('Corina', '(16)3371-7890', None, None, None, '(16)3371-4004')]

Então podemos perguntar:\
<i>Listar um telefone individual e um de emergência de alguém</i>:

In [10]:
%%sql
SELECT Nome,
       COALESCE (Resid, Celular, Comerc) AS Individual,
       COALESCE (Pais, Esposa, Comerc, 'não tem') AS Emergência
    FROM FonePessoa
    WHERE Nome='Cibele';

 * postgresql://postgres:***@localhost/alunos15
1 rows affected.

[('Cibele', '(16)3371-2003', '(16)3371-3003')]

Ou de todos:

In [11]:
%%sql
SELECT Nome,
       COALESCE (Resid, Celular, Comerc) AS Individual,
       COALESCE (Pais, Esposa, Comerc, 'não tem') AS Emergência
    FROM FonePessoa
--  WHERE Nome='Cibele';

 * postgresql://postgres:***@localhost/alunos15
7 rows affected.

[('Carlos', None, 'não tem'),
 ('Celso', '(16)3371-2345', 'não tem'),
 ('Cicero', '(16)3371-3456', '(16)3371-3000'),
 ('Carlitos', None, '(16)3371-3000'),
 ('Catarina', '(16)99371-1002', '(16)3371-3002'),
 ('Cibele', '(16)3371-2003', '(16)3371-3003'),
 ('Corina', '(16)3371-7890', '(16)3371-4004')]

O conceito de `nulos` não faz parte do Modelo Relacional.\
Com isso, não existe um padrão oficial para se trabalhar com nulos, embora tende a existir um 'padrão de fato'.

Por exemplo, a função `COALESCE` só existe em Postgres.

Existe uma função parecida em Oracle: a função 
<div class=”square” style="background-color:#EAF0F0;"><b><font size="3" face="courier" color="blue">
NVL($<$expressão_1, expressão_2$>$)</font></b></div>
  * Mas ela só pode receber duas expressões.
<br>


Se `expressão_1` não estiver  `nulo`, ela retorna eese valor, senão retorna o valor da `expressão_2`.

<font size="3" color="red">NOTA:</font> Postgres também tem a função `NVL`, identica ao Oracle, para questões de compatibilidade.

<br><br>

----

<br>

#### 3.2.1. A função `NULLIF`

<div class=”square” style="background-color:#EAF0F0;"><b><font size="3" face="courier" color="blue">
NULLIF(valor1, valor2)</font></b></div>
<br>

  * Essa função, de certa maneira, faz o inverso da função `COALESCE`.
  * Ela retorna nulo se `valor1`=`valor2`, caso contrário retorna `valor1`.

Por exemplo:
<i>Obter o telefone residencial e o comercial, mas sem repetir um telefone</i>:

In [12]:
%%sql
SELECT Nome,
       Resid, 
       NULLIF (Comerc, Resid),
       '' "------------>",  --- só para comparar:
       Resid, Celular, Comerc, Pais, Esposa TEXT
    FROM FonePessoa
--  WHERE Nome='Cibele';

 * postgresql://postgres:***@localhost/alunos15
7 rows affected.

[('Carlos', None, None, '', None, None, None, None, None),
 ('Celso', '(16)3371-2345', None, '', '(16)3371-2345', None, None, None, None),
 ('Cicero', '(16)3371-3456', '(16)3371-2000', '', '(16)3371-3456', '(16)99371-1000', '(16)3371-2000', '(16)3371-3000', '(16)3371-4000'),
 ('Carlitos', None, None, '', None, None, None, '(16)3371-3000', '(16)3371-4001'),
 ('Catarina', None, '(16)3371-2000', '', None, '(16)99371-1002', '(16)3371-2000', '(16)3371-3002', None),
 ('Cibele', '(16)3371-2003', None, '', '(16)3371-2003', None, '(16)3371-2003', '(16)3371-3003', '(16)3371-4003'),
 ('Corina', '(16)3371-7890', None, '', '(16)3371-7890', None, None, None, '(16)3371-4004')]

<br>

`NULLIF` é útil por exemplo para <font color="red"><b>evitar divisão por zero:</b></font>

In [13]:
%%sql
SELECT Nome, Nota, Nota*(Nota+1)/Nota
    FROM Aluno Natural Join Matricula
    WHERE CodigoTurma=105;

 * postgresql://postgres:***@localhost/alunos15
(psycopg2.errors.DivisionByZero) division by zero

[SQL: SELECT Nome, Nota, Nota*(Nota+1)/Nota
    FROM Aluno Natural Join Matricula
    WHERE CodigoTurma=105;]
(Background on this error at: https://sqlalche.me/e/20/9h9h)

Quando `Nota` é igual a zero,\
 &emsp; <font size="5">&#9758;</font> `NULLIF(Nota, 0)' resulta nulo.
  * Como divisão por `nulo` resulta `nulo`, a operação não dá erro.

In [14]:
%%sql
SELECT Nome, Nota, Nota*(Nota+1)/NULLIF(Nota,0)
    FROM Aluno Natural Join Matricula
    WHERE CodigoTurma=105;

 * postgresql://postgres:***@localhost/alunos15
4 rows affected.

[('Carlitos', Decimal('7'), Decimal('8.0000000000000000')),
 ('Durval', None, None),
 ('Dora', Decimal('0'), None),
 ('Dina', Decimal('0'), None)]


<br><br>

----

<br><br>

## Operadores de comparação com `NULO`

 * Lembre-se que nulo não é valor: é estado. \
   &emsp; Corresponde à ausência de valor.
 * Para comparar com nulo, é necessário usar a sintaxe:
   * <b><font size="3" face="courier" color="blue">$<$expr$>$ IS NULL</font></b>
   * <b><font size="3" face="courier" color="blue">$<$expr$>$ IS NOT NULL</font></b><br>
 * Se a expressão envolve atrubuto(s) de
 *  uma tupla, então:
    * <b><font size="3" face="courier" color="blue">IS NULL</font></b> retorna verdade quando a expressão na tupla resulta nulo;
    * <b><font size="3" face="courier" color="blue">IS NOT NULL</font></b> retorna verdade quando a expressão na tupla resulta não nulo;
    *  portanto, <b><font size="3" face="courier" color="blue">IS NULL</font></b> e\
      &emsp; &emsp;  <b><font size="3" face="courier" color="blue">IS NOT NULL</font></b>  nem sempre correspondem a resultados negados.

<br>

 * Comparadores tradicionais retornam `verdade`, `falso` ou `Nulo` (`unknown`) quando algum lado da expressão é `Nulo`.
 * Por outro lado:
   * <b><font size="3" face="courier" color="blue">$<$expr$>$ IS DISTINCT FROM</font></b> e
   * <b><font size="3" face="courier" color="blue">$<$expr$>$ IS NOT DISTINCT FROM</font></b>\
     não retornam nulo.
 * Para duas expressões não nulas, `IS DISTINCT FROM` é equivalente a `!=`.\
    Se apenas uma expressão é nula, o retorno é `Verdade` e se ambas são nulas ele retorna `Falso`.\
      `IS NOT DISTINCT FROM` faz o oposto.

Por exemplo:

In [15]:
%%sql
DROP Table IF EXISTS Nulos;
CREATE TABLE Nulos (Atr1, Atr2) AS
           VALUES (1, 1), 
                  (1, 2),
                  (1,null),
                  (null,1),
                  (null,null);

SELECT *, Atr1 IS NULL "Atr1 IS NULL",
          Atr1=Atr2 "Atr1=Atr2", 
          Atr1 IS DISTINCT FROM Atr2 "Atr1 DISTINCT Atr2",
          Atr1 IS NOT DISTINCT FROM Atr2 "Atr1 NOT DISTINCT Atr2",
          Atr1<>Atr2 "Atr1<>Atr2",
          (Atr1, Atr2) IS NULL "(Atr1, Atr2) IS NULL",
          (Atr1, Atr2) IS NOT NULL "(Atr1, Atr2) IS NOT NULL"
    FROM Nulos;

 * postgresql://postgres:***@localhost/alunos15
Done.
5 rows affected.
5 rows affected.

[(1, 1, False, True, False, True, False, False, True),
 (1, 2, False, False, True, False, True, False, True),
 (1, None, False, None, True, False, None, False, False),
 (None, 1, True, None, True, False, None, False, False),
 (None, None, True, None, False, True, None, True, False)]

<br><br>

----

<br><br>

<font size="5" color="red">Lembre-se:\
<b>Tratamento nulos</b> é <u>muito importante</u> para obter respostas corretas.
</font>


Podemos agora remover os objetos que foram usadas nos comandos-exemplo deste Notebook:

In [16]:
%%sql
DROP TABLE IF EXISTS Nulos CASCADE;
DROP TABLE IF EXISTS FonePessoa;

 * postgresql://postgres:***@localhost/alunos15
Done.
Done.

[]

<br><br>

----

<br><br>